Repository: Nardol/recozik
Catalog: src/recozik/locales/*/LC_MESSAGES/recozik.po
Languages: fr

source: Artist: {value}
fr: Artiste : {value}

source: Title: {value}
fr: Titre : {value}

source: AcoustID API key
fr: Clé API AcoustID

source: AcoustID API key to record (alternative to the positional argument).
fr: Clé API AcoustID à enregistrer (alternative à l'argument positionnel).

source: AcoustID API key to record.
fr: Clé API AcoustID à enregistrer.

source: AcoustID API key to use (takes priority over the configuration file).
fr: Clé API AcoustID à utiliser (prioritaire sur la configuration).

source: AcoustID key stored in {path}
fr: Clé AcoustID enregistrée dans {path}

source: AcoustID key: not configured
fr: Clé AcoustID : non configurée

source: AcoustID key: {masked}
fr: Clé AcoustID : {masked}

source: AudD API token
fr: Jeton API AudD

source: AudD API token to record.
fr: Jeton API AudD à enregistrer.

source: AudD API token to record (alternative to the positional argument).
fr: Jeton API AudD à enregistrer (alternative à l'argument positionnel).

source: AudD API token to use as a fallback when AcoustID returns no match.
fr: Jeton API AudD à utiliser comme repli lorsque AcoustID ne trouve aucun résultat.

source: AudD fallback failed for {path}: {error}
fr: Le fallback AudD a échoué pour {path} : {error}

source: AudD fallback failed: {error}
fr: Le fallback AudD a échoué : {error}

source: AudD fallback identified {path}. Powered by AudD Music.
fr: Le fallback AudD a identifié {path}. Powered by AudD Music.

source: AudD lookup failed: {error}.
fr: La recherche AudD a échoué : {error}.

source: AudD lookup failed: {error}. Falling back to AcoustID.
fr: La recherche AudD a échoué : {error}. Repli vers AcoustID.

source: AudD lookup failed for {path}: {error}. Falling back to AcoustID.
fr: La recherche AudD a échoué pour {path} : {error}. Repli vers AcoustID.

source: AudD token removed from {path}
fr: Jeton AudD supprimé de {path}

source: AudD token stored in {path}
fr: Jeton AudD enregistré dans {path}

source: AudD token: not configured
fr: Jeton AudD : non configuré

source: AudD token: {masked}
fr: Jeton AudD : {masked}

source: Add `{command}` to your `$PROFILE` (PowerShell) to load completion automatically.
fr: Ajoutez `{command}` à votre `$PROFILE` (PowerShell) pour charger automatiquement la complétion.

source: Add it to your shell configuration if needed.
fr: Ajoutez-la à votre configuration de shell si nécessaire.

source: Already named correctly: {name}
fr: Déjà au bon nom : {name}

source: Append to the existing log instead of recreating it.
fr: Ajoute à la fin du log existant au lieu de le recréer.

source: Ask for confirmation before renaming each file.
fr: Demande une confirmation pour chaque fichier avant renommage.

source: Apply the planned renames now?
fr: Appliquer les renommages prévus maintenant ?

source: Log cleanup strategy after applying renames: ask (default), always, or never.
fr: Stratégie de nettoyage du log après application des renommages : ask (défaut), always ou never.

source: Invalid --log-cleanup value. Choose ask, always, or never.
fr: Valeur --log-cleanup invalide. Choisissez ask, always ou never.

source: Confirm renames based on embedded metadata (use --metadata-fallback-no-confirm).
fr: Confirme les renommages basés sur les métadonnées intégrées (utilisez --metadata-fallback-no-confirm).

source: Cache enabled: {state} (TTL: {hours} h)
fr: Cache activé : {state} (TTL : {hours} h)

source: Channels: {channels}
fr: Canaux : {channels}

source: Check ~/.zshrc and remove the line adding ~/.zfunc if you no longer use it.
fr: Vérifiez votre ~/.zshrc et retirez la ligne ajoutant ~/.zfunc si vous ne l'utilisez plus.

source: Chromaprint fingerprint:
fr: Empreinte Chromaprint :

source: Collision handling strategy: append (default), skip, overwrite.
fr: Gestion des collisions : append (défaut), skip, overwrite.

source: Log file already removed: {path}
fr: Fichier de log déjà supprimé : {path}

source: Remove the stored AudD token.
fr: Supprime le jeton AudD enregistré.

source: Unable to delete log file {path}: {error}
fr: Impossible de supprimer le fichier de log {path} : {error}

source: Log file deleted: {path}
fr: Fichier de log supprimé : {path}

source: Log file kept: {path}
fr: Fichier de log conservé : {path}

source: Delete the log file {path}?
fr: Supprimer le fichier de log {path} ?

source: Operation cancelled; log file kept.
fr: Opération annulée ; fichier de log conservé.

source: Command to add: {command}
fr: Commande à ajouter : {command}

source: Completion installed for {shell}.
fr: Complétion installée pour {shell}.

source: Completion installed. Restart your terminal to use it.
fr: Complétion installée. Rechargez votre terminal pour l'utiliser.

source: Completion script removed: {path}
fr: Script de complétion supprimé : {path}

source: Completion script written to {path}
fr: Script de complétion écrit dans {path}

source: Completion uninstalled.
fr: Complétion désinstallée.

source: Confirm rename based on embedded metadata: {source} -> {target}?
fr: Confirmer le renommage basé sur les métadonnées : {source} -> {target} ?

source: Confirm the key
fr: Confirmez la clé

source: Control how paths are written in the log (overrides configuration).
fr: Contrôle l'affichage des chemins dans le log (écrase la configuration).

source: Create or update your key with `recozik config set-key`.
fr: Créez ou mettez à jour votre clé avec `recozik config set-key`.

source: Custom configuration file path (tests).
fr: Chemin personnalisé du fichier de configuration (tests).

source: Default template: {template}
fr: Template par défaut : {template}

source: Set it with `recozik config set-audd-token` when you are ready.
fr: Configurez-le avec `recozik config set-audd-token` quand vous êtes prêt.

source: No AudD token provided.
fr: Aucun jeton AudD fourni.

source: Directory containing the audio files.
fr: Dossier contenant les fichiers audio.

source: Directory not found: {path}
fr: Dossier introuvable : {path}

source: Directory where originals are copied before renaming (optional).
fr: Dossier dans lequel copier les originaux avant renommage (optionnel).

source: Display basic metadata extracted from an audio file.
fr: Affiche les métadonnées de base du fichier audio.

source: Show full fingerprint in console (long and less convenient for screen readers).
fr: Affiche l'empreinte complète dans la console (longue et moins pratique pour les lecteurs d'écran).

source: Display the generated auto-completion script.
fr: Affiche le script d'auto-complétion généré.

source: Display the main configuration settings.
fr: Affiche les principaux paramètres de configuration.

source: Display the path to the configuration file in use.
fr: Affiche le chemin du fichier de configuration utilisé.

source: Preview rename operations only (default, configurable). Use --apply to commit changes.
fr: Prévisualise uniquement les renommages (par défaut, valeur configurable). Utilisez --apply pour valider les changements.

source: Display the results as JSON (useful for scripting or screen readers).
fr: Affiche les résultats au format JSON (utile pour les scripts ou les lecteurs d'écran).

source: Dry-run complete: {planned} potential renames, {skipped} skipped, {errors} errors.
fr: Simulation terminée : {planned} renommages potentiels, {skipped} ignoré(s), {errors} en erreur.

source: Use --apply to run the renames.
fr: Utilisez --apply pour lancer les renommages.

source: Edit your $PROFILE file to remove the completion block added by Recozik.
fr: Éditez votre fichier $PROFILE pour retirer le bloc de complétion ajouté par Recozik.

source: Embedded metadata:
fr: Métadonnées (tags) :

source: Entry with error, skipped: {path} ({error})
fr: Entrée en erreur, ignorée : {path} ({error})

source: Entry without a path: skipped.
fr: Entrée sans chemin : ignorée.

source: Estimated duration: {duration:.2f} s
fr: Durée estimée : {duration:.2f} s

source: Explicit path to the fpcalc executable when Chromaprint is not on PATH.
fr: Chemin explicite vers l'exécutable fpcalc si Chromaprint n'est pas dans PATH.

source: File extension to include (e.g. mp3). Can be repeated.
fr: Extension de fichier à inclure (ex : mp3). Peut être répétée.

source: File not found, skipped: {path}
fr: Fichier introuvable, ignoré : {path}

source: File not found: {path}
fr: Fichier introuvable : {path}

source: File where the fingerprint should be written in JSON format.
fr: Fichier dans lequel écrire l'empreinte au format JSON.

source: File: {path}
fr: Fichier : {path}

source: Fingerprint saved to {path}
fr: Empreinte sauvegardée dans {path}

source: Frame count: {frames}
fr: Nombre d'images : {frames}

source: Generate the Chromaprint fingerprint of an audio file.
fr: Génère l'empreinte Chromaprint d'un fichier audio.

source: Glob pattern to apply (can be repeated).
fr: Motif glob à appliquer (peut être répété).

source: Identify a track using the AcoustID API.
fr: Identifie un morceau via l'API AcoustID.

source: Identify audio files in a directory and persist the results.
fr: Identifie les fichiers audio d'un dossier et enregistre les résultats.

source: Ignore the local cache and force a new API call.
fr: Ignore le cache local et force un nouvel appel à l'API.

source: Ignore the local cache and force a new API request.
fr: Ignore le cache local et force un nouvel appel à l'API.

source: Index out of range, please try again.
fr: Indice hors plage, veuillez réessayer.

source: Install the shell completion script for the current shell.
fr: Installe le script d'auto-complétion pour le shell courant.

source: Invalid --on-conflict value. Choose append, skip, or overwrite.
fr: Valeur --on-conflict invalide. Choisissez append, skip ou overwrite.

source: Invalid JSON response received from AcoustID.
fr: Réponse JSON invalide reçue depuis AcoustID.

source: Invalid JSONL entry (line {number}).
fr: Entrée invalide au format JSONL (ligne {number}).

source: Invalid TOML configuration in {path}: {error}
fr: Configuration TOML invalide dans {path} : {error}

source: Invalid input (y/n).
fr: Réponse invalide (o/n).

source: Invalid log format. Use 'text' or 'jsonl'.
fr: Format de log invalide. Utilisez 'text' ou 'jsonl'.

source: Invalid selection, please try again.
fr: Sélection invalide, veuillez réessayer.

source: Interrupt received during interactive selection.
fr: Interruption détectée pendant la sélection interactive.

source: 1. Cancel everything and exit.
fr: 1. Tout annuler et quitter.

source: 2. Stop asking questions and apply the confirmed renames.
fr: 2. Arrêter les questions et appliquer les renommages confirmés.

source: 3. Resume the current question.
fr: 3. Reprendre la question en cours.

source: Choose an option:
fr: Choisissez une option :

source: Use the menu to continue.
fr: Utilisez le menu pour continuer.

source: No rename has been confirmed yet, nothing to apply.
fr: Aucun renommage confirmé pour le moment, rien à appliquer.

source: Invalid option, please try again.
fr: Option invalide, veuillez réessayer.

source: JSONL log generated by `identify-batch`.
fr: Log JSONL généré par `identify-batch`.

source: Key rejected by AcoustID.
fr: Clé refusée par AcoustID.

source: Key validation failed: {message}
fr: Validation de la clé échouée : {message}

source: Log file not found: {path}
fr: Log introuvable : {path}

source: Log format: text or jsonl.
fr: Format du log : text ou jsonl.

source: Log format: {format} (paths {mode})
fr: Format du log : {format} (chemins {mode})

source: Manage local configuration.
fr: Gestion de la configuration locale.

source: Metadata-based rename skipped for {name}.
fr: Renommage par métadonnées ignoré pour {name}

source: Multiple proposals for {name}:
fr: Plusieurs propositions pour {name} :

source: Music recognition based on audio fingerprints.
fr: Reconnaissance musicale basée sur les empreintes audio.

source: No API key provided.
fr: Aucune clé API fournie.

source: No AcoustID API key configured.
fr: Aucune clé API AcoustID configurée.

source: No AcoustID match for {path}, using embedded metadata.
fr: Aucune correspondance AcoustID pour {path}, utilisation des métadonnées intégrées.

source: No audio files matched the selection.
fr: Aucun fichier audio correspondant.

source: No completion script to remove.
fr: Aucun script de complétion spécifique à supprimer.

source: No entries found in the log.
fr: Aucune entrée dans le log.

source: No key was stored. Operation cancelled.
fr: Aucune clé n'a été enregistrée. Opération annulée.

source: No match for {path}, embedded metadata recorded in the log.
fr: Aucune correspondance pour {path}, métadonnées locales enregistrées.

source: No match.
fr: Aucune correspondance.

source: No matches found.
fr: Aucune correspondance trouvée.

source: No metadata available (mutagen library missing).
fr: Métadonnées non disponibles (bibliothèque mutagen absente).

source: No proposal for: {path}
fr: Aucune proposition pour : {path}

source: No proposal for: {path}{context}
fr: Aucune proposition pour : {path}{context}

source: No rename performed ({skipped} skipped, {errors} errors).
fr: Aucun renommage à effectuer ({skipped} ignoré(s), {errors} en erreur).

source: No selection made for {name}; skipping.
fr: Aucune sélection faite pour {name}, passage.

source: Number of proposals to keep for each file.
fr: Nombre de propositions à conserver.

source: Number of results to display.
fr: Nombre de résultats à afficher.

source: Offer an interactive choice when multiple matches are available.
fr: Propose un choix interactif quand plusieurs correspondances sont disponibles.

source: Operation cancelled.
fr: Opération annulée.

source: Operation cancelled; no files renamed.
fr: Opération annulée ; aucun fichier renommé.

source: Continuing with renames confirmed before the interruption.
fr: Poursuite des renommages confirmés avant l'interruption.

source: Output template (placeholders: {artist}, {title}, {album}, {score}, ...).
fr: Modèle d'affichage ({artist}, {title}, {album}, {score}, ...).

source: Output the completion script to stdout without writing files.
fr: Génère le script sur la sortie standard sans créer/modifier de fichier.

source: Override the locale for this invocation (examples: en, fr, fr_FR).
fr: Force la locale pour cette exécution (exemples : en, fr, fr_FR).

source: Path to a JSON file summarising the planned renames.
fr: Chemin d'un fichier JSON résumant les renommages planifiés.

source: Path to the audio file to analyse.
fr: Chemin du fichier audio à analyser.

source: Path to the audio file to fingerprint.
fr: Chemin du fichier audio à fingerprint.

source: Path to the audio file to identify.
fr: Chemin du fichier audio à identifier.

source: Print only the command to add to your shell profile.
fr: Affiche uniquement la commande à ajouter dans le profil sans texte supplémentaire.

source: Processing complete.
fr: Traitement terminé.

source: Results: {identified} identified, {unmatched} unmatched, {failed} failures.
fr: Résultats : {identified} identifié(s), {unmatched} non reconnu(s), {failed} en erreur.

source: Remove the auto-completion script installed by Recozik.
fr: Supprime le script d'auto-complétion installé par Recozik.

source: Remove the line `source ~/.bash_completions/recozik.sh` from ~/.bashrc if necessary.
fr: Si besoin, supprimez la ligne `source ~/.bash_completions/recozik.sh` de votre ~/.bashrc.

source: Rename files using a JSONL log produced by `identify-batch`.
fr: Renomme les fichiers à partir d'un log JSONL produit par `identify-batch`.

source: Rename skipped for {name}
fr: Renommage ignoré pour {name}

source: Rename template ({artist}, {title}, {album}, {score}, ...).
fr: Modèle de renommage ({artist}, {title}, {album}, {score}, ...).

source: Rename {source} -> {target}?
fr: Renommer {source} -> {target} ?

source: Renaming complete: {renamed} file(s), {skipped} skipped, {errors} errors.
fr: Renommage terminé : {renamed} fichier(s), {skipped} ignoré(s), {errors} en erreur.

source: RENAMED
fr: RENOMMÉ

source: Renaming is in progress. {remaining} file(s) still need to be processed.
fr: Renommage en cours. {remaining} fichier(s) restent à traiter.

source: 1. Stop now (remaining files will stay unchanged).
fr: 1. Arrêter maintenant (les fichiers restants ne seront pas modifiés).

source: 2. Continue renaming the remaining files.
fr: 2. Continuer à renommer les fichiers restants.

source: Please confirm how you want to proceed.
fr: Merci d'indiquer comment poursuivre.

source: Continuing renaming.
fr: Poursuite du renommage.

source: DRY-RUN
fr: SIMULATION

source: Renaming interrupted; {completed} file(s) already renamed, {remaining} file(s) left untouched.
fr: Renommage interrompu ; {completed} fichier(s) déjà renommé(s), {remaining} laissé(s) tel quel.

source: Report output file (default: recozik-batch.log).
fr: Fichier de sortie du rapport (défaut : recozik-batch.log).

source: Restart `fish` or run `{command}` to activate completion.
fr: Relancez `fish` ou exécutez `{command}` pour activer la complétion.

source: Restart fish to apply the removal.
fr: Redémarrez fish pour prendre en compte la suppression.

source: Result {index}: score {score:.2f}
fr: Résultat {index} : score {score:.2f}

source: Root directory containing the files to rename (defaults to the log directory).
fr: Répertoire racine contenant les fichiers à renommer (défaut : dossier du log).

source: Run `{command}` or add this line to your profile file (e.g. ~/.bashrc, ~/.zshrc).
fr: Exécutez `{command}` ou ajoutez cette ligne à votre fichier de profil (ex. ~/.bashrc, ~/.zshrc).

source: Sample rate: {samplerate} Hz
fr: Fréquence d'échantillonnage : {samplerate} Hz

source: Search recursively in sub-directories.
fr: Active la recherche récursive dans les sous-dossiers.

source: Select a number (press ENTER to cancel):
fr: Sélectionnez un numéro (ENTER pour annuler) :

source: Shell auto-completion helpers.
fr: Outils d'auto-complétion du shell.

source: Shell not supported for auto-completion.
fr: Shell non pris en charge pour l'auto-complétion.

source: Skip online validation (not recommended).
fr: Ignore la vérification en ligne (déconseillé).

source: Store an AcoustID API key in the configuration.
fr: Enregistre une clé API AcoustID dans la configuration.

source: Store only the best proposal for each file.
fr: Enregistre uniquement la meilleure proposition pour chaque fichier.

source: Summary written to {path}
fr: Résumé écrit dans {path}

source: Target shell (bash, zsh, fish, powershell/pwsh). Autodetected if omitted.
fr: Shell cible (bash, zsh, fish, powershell/pwsh). Détection automatique sinon.

source: Template for proposals ({artist}, {title}, {album}, {score}, ...).
fr: Modèle d'affichage des propositions ({artist}, {title}, {album}, {score}, ...).

source: The field acoustid.api_key must be a string.
fr: Le champ acoustid.api_key doit être une chaîne de caractères.

source: The field cache.ttl_hours must be an integer.
fr: Le champ cache.ttl_hours doit être un entier.

source: The field general.locale must be a string.
fr: Le champ general.locale doit être une chaîne de caractères.

source: The field output.template must be a string.
fr: Le champ output.template doit être une chaîne de caractères.

source: The field rename.log_cleanup must be a string.
fr: Le champ rename.log_cleanup doit être une chaîne.

source: The field rename.log_cleanup must be ask, always, or never.
fr: Le champ rename.log_cleanup doit valoir ask, always ou never.

source: The keys do not match.
fr: Les clés ne correspondent pas.

source: The keys do not match. Operation cancelled.
fr: Les clés ne correspondent pas. Opération annulée.

source: The log must be in JSONL format (rerun `identify-batch` with --log-format jsonl).
fr: Le log doit être au format JSONL (réexécutez `identify-batch` avec --log-format jsonl).

source: The soundfile library is missing; run `uv sync` to install project dependencies.
fr: La bibliothèque soundfile est absente ; lancez `uv sync` pour installer les dépendances.

source: Unable to contact AcoustID ({error}).
fr: Impossible de contacter AcoustID ({error}).

source: Unable to detect the shell. Provide --shell (bash/zsh/fish/pwsh).
fr: Impossible de détecter le shell. Fournissez --shell (bash/zsh/fish/pwsh).

source: Unable to read the audio file: {error}
fr: Impossible de lire le fichier audio : {error}

source: Unable to read the configuration file: {error}
fr: Impossible de lire la configuration : {error}

source: Unexpected HTTP response ({status}).
fr: Réponse HTTP inattendue ({status}).

source: Unknown album
fr: Album inconnu

source: Unknown artist
fr: Artiste inconnu

source: Unknown title
fr: Titre inconnu

source: Unresolved collision, file skipped: {name}
fr: Collision non résolue, fichier ignoré : {name}

source: Use embedded metadata when AcoustID returns no match; follows configuration defaults.
fr: Utilise les métadonnées embarquées lorsqu'AcoustID ne retourne aucune correspondance ; respecte les valeurs de configuration.

source: Use embedded metadata when no proposal is available.
fr: Utilise les métadonnées du fichier lorsqu'aucune proposition n'est disponible.

source: Use only one of --print-command, --no-write, or --output.
fr: Choisissez une seule option parmi --print-command, --no-write ou --output.

source: Commands
fr: Commandes

source: Would you like to save it now?
fr: Souhaitez-vous l'enregistrer maintenant ?

source: Write the completion script to a specific file (absolute or relative path).
fr: Écrit le script de complétion dans un fichier spécifique (chemin absolu ou relatif).

source: [Y/n]
fr: [O/n]

source: [y/N]
fr: [o/N]

source: absolute
fr: absolus

source: no
fr: non

source: relative
fr: relatifs

source: Skip matches missing values required by the rename template.
fr: Ignorer les correspondances dépourvues des valeurs requises par le modèle de renommage.

source: Match skipped for {name}: missing template values ({fields}).
fr: Correspondance ignorée pour {name} : valeurs manquantes pour le modèle ({fields}).

source: The field rename.default_mode must be a string.
fr: Le champ rename.default_mode doit être une chaîne.

source: The field rename.default_mode must be dry-run or apply.
fr: Le champ rename.default_mode doit valoir dry-run ou apply.

source: The field rename.interactive must be a boolean.
fr: Le champ rename.interactive doit être un booléen.

source: The field rename.confirm_each must be a boolean.
fr: Le champ rename.confirm_each doit être un booléen.

source: The field rename.require_template_fields must be a boolean.
fr: Le champ rename.require_template_fields doit être un booléen.

source: The field rename.conflict_strategy must be a string.
fr: Le champ rename.conflict_strategy doit être une chaîne.

source: The field rename.conflict_strategy must be append, skip, or overwrite.
fr: Le champ rename.conflict_strategy doit valoir append, skip ou overwrite.

source: The field rename.metadata_confirm must be a boolean.
fr: Le champ rename.metadata_confirm doit être un booléen.

source: The field identify.limit must be an integer.
fr: Le champ identify.limit doit être un entier.

source: The field identify_batch.limit must be an integer.
fr: Le champ identify_batch.limit doit être un entier.

source: The field identify_batch.log_file must be a string.
fr: Le champ identify_batch.log_file doit être une chaîne.

source: yes
fr: oui

source: Usage:
fr: Utilisation :

source: Try '{command} {option}' for help.
fr: Essayez '{command} {option}' pour obtenir de l'aide.

source: Try [blue]'{command_path} {help_option}'[/] for help.
fr: Essayez [blue]'{command_path} {help_option}'[/] pour obtenir de l'aide.

source: Missing argument
fr: Argument manquant

source: Missing option
fr: Option manquante
