Repository: Nardol/recozik
Catalog: src/recozik/locales/*/LC_MESSAGES/recozik.po
Languages: fr

source: Invalid value for '{param_name}': {message}
fr: Valeur invalide pour '{param_name}' : {message}

source: Error
fr: Erreur

source: Error: {message}
fr: Erreur : {message}
